Revit 2026 API

# AssetPropertyGetSingleConnectedAsset Method

---

Gets the single connected asset attached to this asset property, if it exists.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Asset GetSingleConnectedAsset()
```
```vb
Public Function GetSingleConnectedAsset As Asset
```
```cpp
public:
Asset^ GetSingleConnectedAsset()
```
```fsharp
member GetSingleConnectedAsset : unit -> Asset
```

#### Return Value

Asset The connected asset, or  if there is no connected asset.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Asset is connected to more than one asset. |

Throws if there is more than one connected asset.

#### Reference

AssetProperty Class

Autodesk.Revit.DB.Visual Namespace